src/Documents/ПланП_ПланПроизводстваНаПериод/ПланП_ПланПроизводстваНаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланП_ПланПроизводстваНаПериод</name>
  <registerRecords>InformationRegister.ПланП_ПланЗагрузкиРесурсов</registerRecords>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланПроизводстваПоРесурсам</name>
    <attributes>
      <name>ЗаказНаПроизводство</name>
      <type>
        <types>DocumentRef.ЗаказНаПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПроизводства</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПредприятия</name>
      <type>
        <types>CatalogRef.КлючевыеРесурсы</types>
      </type>
    </attributes>
    <attributes>
      <name>Старт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Финиш</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПланП_ПланПроизводстваНаПериод/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция МаксДата()
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	МАКСИМУМ(ЗаказНаПроизводствоРесурсыПредприятия.Старт) КАК МаксДата
				  |ИЗ
				  |	Документ.ЗаказНаПроизводство.РесурсыПредприятия КАК ЗаказНаПроизводствоРесурсыПредприятия
				  |ГДЕ
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Старт МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.Параметры.Вставить("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МаксДата=Выборка.МаксДата;

	КонецЦикла;
	Возврат МаксДата;
КонецФункции

&НаСервере
Функция МинДата()
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	МИНИМУМ(ЗаказНаПроизводствоРесурсыПредприятия.Старт) КАК МинДата
				  |ИЗ
				  |	Документ.ЗаказНаПроизводство.РесурсыПредприятия КАК ЗаказНаПроизводствоРесурсыПредприятия
				  |ГДЕ
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Старт МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.Параметры.Вставить("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МинДата=Выборка.МинДата;

	КонецЦикла;
	Возврат МинДата;
КонецФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	// Вставить содержимое обработчика.
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Ссылка КАК ЗаказНаПроизводство,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.ПланП_Операция КАК Этап,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.РесурсПредприятия КАК Ресурс,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Старт КАК Старт,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Финиш КАК Финиш,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Заказ КАК Заказ,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Заказ.Контрагент КАК Контрагент
				  |ИЗ
				  |	Документ.ЗаказНаПроизводство.РесурсыПредприятия КАК ЗаказНаПроизводствоРесурсыПредприятия
				  |ГДЕ
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Старт МЕЖДУ &НачалоПериода И &ОкончаниеПериода
				  |	И ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Проведен = ИСТИНА
				  |
				  |СГРУППИРОВАТЬ ПО
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Старт,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Финиш,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Ссылка,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.ПланП_Операция,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.РесурсПредприятия,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Заказ,
				  |	ЗаказНаПроизводствоРесурсыПредприятия.Ссылка.Заказ.Контрагент";
	Запрос.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.Параметры.Вставить("ОкончаниеПериода", КонецДня(Объект.ОкончаниеПериода));
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока=Объект.ПланПроизводстваПоРесурсам.Добавить();
		НовСтрока.ЗаказНаПроизводство=Выборка.ЗаказНаПроизводство;
		НовСтрока.Заказ=Выборка.ЗаказПокупателя;
		НовСтрока.Клиент=Выборка.Контрагент;
		НовСтрока.ЭтапПроизводства=Выборка.Этап;
		НовСтрока.РесурсПредприятия=Выборка.Ресурс;
		НовСтрока.Старт=Выборка.Старт;
		НовСтрока.Финиш=Выборка.Финиш;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	Объект.ПланПроизводстваПоРесурсам.Очистить();
	ЗагрузитьНаСервере();
	ЗаполнитьДиаграммы();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДиаграммы()
	Диаграмма=ЭтотОбъект.ДГ;
	Диаграмма.Обновление=Ложь;
	Диаграмма.Очистить();
	Диаграмма.АвтоОпределениеПолногоИнтервала=Ложь;
	Диаграмма.ПоддержкаМасштаба=ПоддержкаМасштабаДиаграммыГанта.Авто;
	Диаграмма.ОтображатьПустыеЗначения=Ложь;
	Диаграмма.УстановитьПолныйИнтервал( МинДата(), МаксДата());
	Для Каждого ТекСтрока Из Объект.ПланПроизводстваПоРесурсам Цикл
		Точка = Диаграмма.УстановитьТочку(ТекСтрока.Клиент);

		Серия = Диаграмма.УстановитьСерию(ТекСтрока.ЭтапПроизводства);

		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();

		Интервал.Начало = ТекСтрока.Старт;

		Интервал.Конец = ТекСтрока.Финиш;

	КонецЦикла;
	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПланПроизводстваПоРесурсамПриИзменении(Элемент)
	ЗаполнитьДиаграммы();
КонецПроцедуры
